################################################################################
# Taps
################################################################################
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

################################################################################
# Binaries
################################################################################
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'zsh'

################################################################################
# Development
################################################################################
brew 'imagemagick'
brew 'node'
brew 'yarn'

################################################################################
# Apps
################################################################################
# Utility
cask '1password'
cask 'gpg-suite'
cask 'imageoptim'
cask 'iterm2'
cask 'nordvpn'
cask 'pastebot'
cask 'rectangle'
cask 'transmission'
cask 'transmit'
cask 'the-unarchiver'

# Browsers
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'

# Communication
cask 'discord'
cask 'messenger'
cask 'slack'
cask 'telegram'
cask 'zoom'

# Development
cask 'docker'
cask 'github'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'tableplus'
cask 'visual-studio-code'

# Graphics
cask 'figma'

################################################################################
# Quicklook plugins
################################################################################
cask 'qlmarkdown'
cask 'quicklook-json'

################################################################################
# Fonts
################################################################################
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

################################################################################
# Mac App Store
################################################################################
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Lightweight PDF', id: 1450640351
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709